# Напишите программу, которая будет
# преобразовывать десятичное число в двоичное.

import random as r

a = r.randint(-100, 100)
print(a)
print(f'{a:b}')

# Я же правильно понял, что мы именно в двоичной системе работаем, а не
# с представлением двоичных чисел в компьютере (дополнительный код).