# Напишите программу, которая будет
# преобразовывать десятичное число в двоичное.

import random as r

a = r.randint(-100, 100)
print(a)
print(f'{a:b}')

